In [27]:
import pandas as pd
import numpy as np

### loading dataset in pandas

In [28]:
df= pd.read_csv(r"C:\Users\LENOVO\Desktop\pandas\Titanic-Dataset.xls")

### viewing the dataset

In [29]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [30]:
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [31]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

# viewing only passenger

In [32]:
df["Name"]

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

## viewing multiple columns

In [33]:
df[["PassengerId","Name","Survived"]].head(6)

   PassengerId                                               Name  Survived
0            1                            Braund, Mr. Owen Harris         0
1            2  Cumings, Mrs. John Bradley (Florence Briggs Th...         1
2            3                             Heikkinen, Miss. Laina         1
3            4       Futrelle, Mrs. Jacques Heath (Lily May Peel)         1
4            5                           Allen, Mr. William Henry         0
5            6                                   Moran, Mr. James         0

### indexing

In [34]:
df.loc[4:10, "Name":"Parch"]

,Name,Sex,Age,SibSp,Parch
4,"Allen, Mr. William Henry",male,35.0,0,0
5,"Moran, Mr. James",male,NaN,0,0
6,"McCarthy, Mr. Timothy J",male,54.0,0,0
7,"Palsson, Master. Gosta Leonard",male,2.0,3,1
8,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2
9,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0
10,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1

### viewing table columns from index 10 to 20 and only show ticket to embarked columns

In [35]:
df.loc[10:20, "Ticket":"Embarked"]

       Ticket     Fare Cabin Embarked
10    PP 9549  16.7000    G6        S
11     113783  26.5500  C103        S
12  A/5. 2151   8.0500   NaN        S
13     347082  31.2750   NaN        S
14     350406   7.8542   NaN        S
15     248706  16.0000   NaN        S
16     382652  29.1250   NaN        Q
17     244373  13.0000   NaN        S
18     345763  18.0000   NaN        S
19       2649   7.2250   NaN        C
20     239865  26.0000   NaN        S

In [36]:
df.iloc[10:21, 8:]

       Ticket     Fare Cabin Embarked
10    PP 9549  16.7000    G6        S
11     113783  26.5500  C103        S
12  A/5. 2151   8.0500   NaN        S
13     347082  31.2750   NaN        S
14     350406   7.8542   NaN        S
15     248706  16.0000   NaN        S
16     382652  29.1250   NaN        Q
17     244373  13.0000   NaN        S
18     345763  18.0000   NaN        S
19       2649   7.2250   NaN        C
20     239865  26.0000   NaN        S

In [37]:
df.iloc[15:26, 2:8:]

,Pclass,Name,Sex,Age,SibSp,Parch
15,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0
16,3,"Rice, Master. Eugene",male,2.0,4,1
17,2,"Williams, Mr. Charles Eugene",male,NaN,0,0
18,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0
19,3,"Masselmani, Mrs. Fatima",female,NaN,0,0
20,2,"Fynney, Mr. Joseph J",male,35.0,0,0
21,2,"Beesley, Mr. Lawrence",male,34.0,0,0
22,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0
23,1,"Sloper, Mr. William Thompson",male,28.0,0,0
24,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1
25,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5

### only showing selected columns

In [38]:
df[["Name","Parch"]].head(4)

                                                Name  Parch
0                            Braund, Mr. Owen Harris      0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...      0
2                             Heikkinen, Miss. Laina      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)      0

### getting information about the data

In [39]:
df.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
387,388,1,2,"Buss, Miss. Kate",female,36.0,0,0,27849,13.0,NaN,S

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### checking missing values

In [41]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [42]:
df["Embarked"].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [43]:
age_mean=df["Age"].mean().__round__()
embarked_mode=df["Embarked"].mode()[0]

In [44]:
df["Age"]=df["Age"].fillna(age_mean)
df["Embarked"]=df["Embarked"].fillna(embarked_mode)
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,30.0,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [45]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [46]:
df["Survived"].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

### removing unimportant features(columns)

In [47]:
removing_columns= ["PassengerId","Name","Ticket"]
df=df.drop(columns=removing_columns)
df.head(10)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500   NaN        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250   NaN        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500   NaN        S
5         0       3    male  30.0      0      0   8.4583   NaN        Q
6         0       1    male  54.0      0      0  51.8625   E46        S
7         0       3    male   2.0      3      1  21.0750   NaN        S
8         1       3  female  27.0      0      2  11.1333   NaN        S
9         1       2  female  14.0      1      0  30.0708   NaN        C

In [48]:
df["Family_Size"]=df["SibSp"] + df["Parch"] +1
removing_columns= ["SibSp","Parch"]
df=df.drop(columns=removing_columns)
df=df.drop(columns=["Cabin"])
df.head(4)

   Survived  Pclass     Sex   Age     Fare Embarked  Family_Size
0         0       3    male  22.0   7.2500        S            2
1         1       1  female  38.0  71.2833        C            2
2         1       3  female  26.0   7.9250        S            1
3         1       1  female  35.0  53.1000        S            2

### converting categorical data into numerical

In [49]:
df["Sex"]=df["Sex"].map({"male":1,"female":0})
df.head(5)

   Survived  Pclass  Sex   Age     Fare Embarked  Family_Size
0         0       3    1  22.0   7.2500        S            2
1         1       1    0  38.0  71.2833        C            2
2         1       3    0  26.0   7.9250        S            1
3         1       1    0  35.0  53.1000        S            2
4         0       3    1  35.0   8.0500        S            1

In [50]:
df1=df.copy()
df1=pd.get_dummies(df1, columns=['Embarked'],dtype=int, drop_first=True)
df1.head(10)

   Survived  Pclass  Sex   Age     Fare  Family_Size  Embarked_Q  Embarked_S
0         0       3    1  22.0   7.2500            2           0           1
1         1       1    0  38.0  71.2833            2           0           0
2         1       3    0  26.0   7.9250            1           0           1
3         1       1    0  35.0  53.1000            2           0           1
4         0       3    1  35.0   8.0500            1           0           1
5         0       3    1  30.0   8.4583            1           1           0
6         0       1    1  54.0  51.8625            1           0           1
7         0       3    1   2.0  21.0750            5           0           1
8         1       3    0  27.0  11.1333            3           0           1
9         1       2    0  14.0  30.0708            2           0           0

In [51]:
def fair_category(fare):
    if fare<15 :
        return ("Low")
    elif fare>40:
        return("Medium")
    else:
        return("High")
    
df1["Fair_Category"]=df["Fare"].apply(fair_category)
df1.head(10)

,Survived,Pclass,Sex,Age,Fare,Family_Size,Embarked_Q,Embarked_S,Fair_Category
0,0,3,1,22.0,7.2500,2,0,1,Low
1,1,1,0,38.0,71.2833,2,0,0,Medium
2,1,3,0,26.0,7.9250,1,0,1,Low
3,1,1,0,35.0,53.1000,2,0,1,Medium
4,0,3,1,35.0,8.0500,1,0,1,Low
5,0,3,1,30.0,8.4583,1,1,0,Low
6,0,1,1,54.0,51.8625,1,0,1,Medium
7,0,3,1,2.0,21.0750,5,0,1,High
8,1,3,0,27.0,11.1333,3,0,1,Low
9,1,2,0,14.0,30.0708,2,0,0,High